package by.htp.les01.main;

public class Main21 {

	public static void main(String[] args) {
		// 21. Дано действительное число R вида nnn.ddd (три цифровых разряда в дробной и целой
		//частях). Поменять местами дробную и целую части числа и вывести полученное значение
	    //числа
		
		System.out.println ();
	}
}
