package by.htp.les01.main;

public class Main7 {
	// 7. Дан прямоугольник, ширина которого в два раза меньше длины. Найти площадь
    //прямоугольника

    public static void main (String[] args) {
    	double length = 2.4;
    	double width = length / 2;
    	double s = length*width;
			System.out.println("Задача 7. Ответ: s = " + s);
    }
}
