package by.htp.les01.main;

public class Main9 {
	//9. Вычислить значение выражения по формуле (все переменные принимают
    //	действительные значения):
    public static void main (String[] args) {
    	double a = 5.5;
    	double b = 6.6;
    	double c = 7.7;
		double d = 9.8;
		double f = (a / c)*(b / d) - (a*b - c)/(c * d);
			System.out.println("Задача 9. Ответ: " + f);
    }
}
