package by.htp.les01.main;

public class Main1 {

		//1. Даны два действительных числа х и у. Вычислить их сумму, разность, произведение и
		//частное
	
		public static void main(String[] args) {
		int x = 150;
		int y = 10;
			System.out.println(" x + y = " + (x + y));
			System.out.println(" x - y = " + (x - y));
			System.out.println(" x * y = " + (x * y));
			System.out.println(" x / y = " + (x / y));
		}
	}